export type Event = {
    type: string,
    geometry: Geom,
    properties: Props
}

export type Geom = {
    type: string,
    coordinates: number[] | number[][]
}

export type Props = {
    name: string,
    start: string,
    end: string
}

export const events: Event[] = [{
    type: "Feature",
    geometry: {
        type: "Point",
        coordinates: [37.760375, 55.640663]
    },
    properties: {
        name: "Стоянка №1",
        start: "2023-10-20T22:56",
        end: "2023-10-21T11:45"
    }
},
{
    type: "Feature",
    geometry: {
        type: "Point",
        coordinates: [37.601241, 55.664902]
    },
    properties: {
        name: "Датчик",
        start: "2023-10-20T22:56",
        end: "2023-10-21T18:00"
    }
},
{
    type: "Feature",
    geometry: {
        type: "LineString",
        coordinates: [
            [37.760375, 55.640663],
            [37.760829, 55.640928],
            [37.760579, 55.641422],
            [37.738364, 55.635856],
            [37.732577, 55.635206],
            [37.702429, 55.635768],
            [37.696073, 55.636592],
            [37.652801, 55.653146],
            [37.632567, 55.662543],
            [37.629932, 55.665112],
            [37.623655, 55.682746],
            [37.620399, 55.699211],
            [37.621687, 55.703032],
            [37.621154, 55.708082],
            [37.622270, 55.711405],
            [37.606380, 55.711985],
            [37.611810, 55.727466],
            [37.609818, 55.727543],
            [37.583840, 55.709856],
            [37.545395, 55.688147],
            [37.538319, 55.692001],
            [37.537460, 55.691590]
        ]
    },
    properties: {
        name: "Движение",
        start: "2023-10-21T11:45",
        end: "2023-10-21T13:12"
    }
},
{
    type: "Feature",
    geometry: {
        type: "Point",
        coordinates: [37.537460, 55.691590]
    },
    properties: {
        name: "Стоянка №2",
        start: "2023-10-21T13:12",
        end: "2023-10-21T13:27"
    }
},
{
    type: "Feature",
    geometry: {
        type: "LineString",
        coordinates: [
            [37.537460, 55.691590],
            [37.538319, 55.692001],
            [37.506375, 55.710374],
            [37.499574, 55.721730],
            [37.480220, 55.742910],
            [37.508247, 55.751153],
            [37.507302, 55.751669],
            [37.508578, 55.753075]
        ]
    },
    properties: {
        name: "Движение",
        start: "2023-10-21T13:27",
        end: "2023-10-21T14:44"
    }
},
{
    type: "Feature",
    geometry: {
        type: "Point",
        coordinates: [37.508578, 55.753075]
    },
    properties: {
        name: "Стоянка №3",
        start: "2023-10-21T14:44",
        end: "2023-10-21T14:59"
    }
},
{
    type: "Feature",
    geometry: {
        type: "LineString",
        coordinates: [
            [37.508578, 55.753075],
            [37.507302, 55.751669],
            [37.510599, 55.749928],
            [37.514758, 55.746734],
            [37.498433, 55.741574],
            [37.499252, 55.740592],
            [37.485843, 55.736803],
            [37.459041, 55.731832],
            [37.459166, 55.731593],
            [37.458983, 55.731435]
        ]
    },
    properties: {
        name: "Движение",
        start: "2023-10-21T14:59",
        end: "2023-10-21T15:52"
    }
},
{
    type: "Feature",
    geometry: {
        type: "Point",
        coordinates: [37.458983, 55.731435]
    },
    properties: {
        name: "Стоянка №4",
        start: "2023-10-21T15:52",
        end: "2023-10-21T16:05"
    }
},
{
    type: "Feature",
    geometry: {
        type: "LineString",
        coordinates: [
            [37.458983, 55.731435],
            [37.459166, 55.731593],
            [37.460019, 55.729960],
            [37.456111, 55.729827],
            [37.450791, 55.730594],
            [37.446310, 55.729990],
            [37.454153, 55.711868],
            [37.456120, 55.705997],
            [37.461038, 55.698713],
            [37.477327, 55.685773],
            [37.513718, 55.706084],
            [37.562695, 55.677685],
            [37.601241, 55.664902]
        ]
    },
    properties: {
        name: "Движение",
        start: "2023-10-21T16:05",
        end: "2023-10-21T18:00"
    }
}]